import { textCommands } from "./constants";

export const ErrorMessage = {
  DEFAULT: "Ошибка в боте",
  NO_STREAM: "Пока не можем скачивать аудио в данном формате..."
} as const;


export const getGreetingText = (name = "Друг") => {
  return `<b>👋 Привет, ${ name }!</b>\n\n` +
    `<b>🤖 О боте: Tg Music downloader</b>\n` +
    '\n' +
    'Я помогаю скачивать треки прямо в Telegram!\n' +
    '\n' +
    '<b>Что я умею:</b>\n' +
    '🔍 <b>Поиск музыки</b> - просто напишите название трека или исполнителя\n' +
    '⬇️ <b>Скачивание в MP3</b> - выбирайте из найденных треков\n' +
    '🎧 <b>Качественное аудио</b> - скачиваю в оригинальном качестве\n' +
    '\n' +
    '<b>Как пользоваться:</b>\n' +
    '1. Напишите название трека или исполнителя\n' +
    '2. Выберите нужный трек из списка\n' +
    '3. Получите аудио файл \n' +
    '\n' +
    'Начните с поиска! Просто напишите название трека. 🎶';
}

export const getHelpText = () => {
  return textCommands
    .map(command => `${ command.name } - ${ command.text }`)
    .join(',\n')
}
